Examinator/src/Catalogs/ПубликацииВебКабинетаСУ/ПубликацииВебКабинетаСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПубликацииВебКабинетаСУ</name>
  <attributes>
    <name>АдресВебСервера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПубликации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПубликацииИБ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПубликацийРесурсов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресКаталогаКабинета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресКаталогаФайлов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресКаталогаКартинок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЛоготипа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервисаОбучения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СлужебныйПользовательУказанВПубликацииИнформационнойБазы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогинСлужебногоПользователя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольСлужебногоПользователя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНовостиСтарее</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервисаПользователи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервисаЭР</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресВебСервисаЭР</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервисаЭлектронныхКурсов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступнаСвободнаяРегистрация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСтраницыРегистрации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступноВосстановлениеПароля</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСтраницыВосстановленияПароля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступнаСтандартнаяАутентификация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступнаАутентификацияCAS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервераCAS</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервисаCAS</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервераCAS</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИконкаСервераCAS</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступенСписокОбучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступенКалендарьОбучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступноОткрытоеОбучение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступныРезультатыОбучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступныСертификатыОбучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьСтатусОбучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступнаКарточкаОбучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантКалендаря</name>
    <type>
      <types>EnumRef.ВариантыКалендаряВебКабинетаСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступнаОтправкаЛичныхСообщенийИзКарточкиПользователя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьЭлектронныеРесурсыОбученияВНовомОкне</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьЭлементыБиблиотекиВНовомОкне</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьКоличествоЭлементовРазделаБиблиотеки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтартоваяСтраница</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьРолиПреподавателей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПользователейОнлайн</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПользователейОнлайнВМеню</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПинКодыДляРегистрации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоступнаАутентификацияOpenID</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПровайдераOpenID</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПровайдераOpenID</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтменятьАутентификациюПровайдераOpenIDПриВыходе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьАутентификациюПровайдераOpenIDПослеЗагрузкиСтраниц</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПоискПоЭлектроннымРесурсам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Язык</name>
    <type>
      <types>EnumRef.ЯзыкиВебКабинетаСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступенРазделПроверкиЗаданий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НижнийКолонтитул</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступенПолныйКаталогПользователей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоЕдинственнаяПубликацияВОбщемКаталоге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Редакция</name>
    <type>
      <types>EnumRef.РедакцииВебКабинетаСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикЯндексМетрики</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСервисаSentry</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьСведенияВКонсоль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешенноеЧислоМинутНеактивности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказатьПинКодыНаГлавнойСтранице</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧастотаСбораСтатистики</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПоляИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПоляИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбразецЗаполненияПоляИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазместитьСсылкуРегистрацииСверху</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьИзменятьФотографиюПрофиля</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьИзменятьКонтактнуюИнформациюВПрофиле</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьИзменятьДополнительнуюИнформациюВПрофиле</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьИзменятьНастройкиРассылокВПрофиле</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНаОтзывОтветаНаЗадание</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОформлениеКомандыПрофиля</name>
    <type>
      <types>EnumRef.ВариантыОформленияКомандыПрофиляВебКабинетаСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступноОткрытиеОтчетаВФорматеPDF</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступноОткрытиеОтчетаВФорматеExcel</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступноОткрытиеОтчетаВКабинете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодключитьОтчеты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступенПолныйСписокОтчетов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьПустыеПапкиБиблиотеки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Разделы</name>
    <attributes>
      <name>Контейнер</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Иконка</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страница</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Якорь</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоступенПублично</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоступенПослеАвторизации</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроверятьПрава</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоляРегистрации</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>EnumRef.ВидыПолейРегистрацииВебКабинетаСУО</types>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПоля</name>
      <type>
        <types>EnumRef.ТипыПолейРегистрацииВебКабинетаСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактнаяИнформация</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобавлятьПолеПодтверждения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Обязательное</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПодтверждения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьКакЛогин</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РазмещениеОтчетов</name>
    <attributes>
      <name>Отчет</name>
      <type>
        <types>CatalogRef.ВариантыОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Размещение</name>
      <type>
        <types>EnumRef.ВариантыРазмещенияОтчетовВебКабинетаСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГруппировкиОбучений</name>
    <attributes>
      <name>Группировка</name>
      <type>
        <types>EnumRef.ГруппировкиОбученийВебКабинетаСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Использовать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование_ru</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование_en</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Enums/ТемыВебКабинетаСУ/ТемыВебКабинетаСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТемыВебКабинетаСУ</name>
  <enumValues>
    <name>Облако</name>
  </enumValues>
  <enumValues>
    <name>Пляж</name>
  </enumValues>
  <enumValues>
    <name>Аквамарин</name>
  </enumValues>
  <enumValues>
    <name>Лето</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/РедакцииВебКабинетаСУ/РедакцииВебКабинетаСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РедакцииВебКабинетаСУ</name>
  <enumValues>
    <name>Редакция20</name>
  </enumValues>
  <enumValues>
    <name>Редакция30</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/ПубликацииВебКабинетаСУ/Forms/УстановкаИОбновление/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполняем реквизиты
	
	Редакция = ВебКабинетСУ.Редакция();
	ПутьКОбщемуКаталогу = ОбъектыСУЗПовтИсп.ПутьКОбщемуКаталогу();
	АвтоматическаяНастройка = ВебКабинетСУ.ИспользуетсяАвтоматическаяНастройка();
	ПутьККаталогуКабинета = ВебКабинетСУ.ПутьККаталогуУстановки(ПутьКОбщемуКаталогу);
	АдресИнформационнойБазы = ОбщегоНазначенияСУ.АдресИнформационнойБазы();
	Тема = Перечисления.ТемыВебКабинетаСУ.Облако;
	ФоновымЗаданием = Истина;			
	ИмяФайлаДистрибутива = ВебКабинетСУ.ИмяФайлаДистрибутива();
	РедакцияСтрока = ВебКабинетСУ.РедакцияСтрока();
	
	Если АвтоматическаяНастройка Тогда
		ЕдинственнаяАвтоПубликация = Справочники.ПубликацииВебКабинетаСУ.ЕдинственнаяПубликацияВОбщемКаталоге();
		Если ЗначениеЗаполнено(ЕдинственнаяАвтоПубликация) Тогда
			РегистрационныйНомер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЕдинственнаяАвтоПубликация, "РегистрационныйНомер");
		КонецЕсли;
	КонецЕсли;
	
	РегистрационныйНомерПриИзмененииНаСервере();
	
	УстановитьКартинкуТемы();
	
	// Устанавливаем видимость элементов
	
	Элементы.РегистрационныйНомер.Видимость = АвтоматическаяНастройка;
	Элементы.ОписаниеРегистрационногоНомера.Видимость = АвтоматическаяНастройка;
	
	Элементы.ГруппаРедакция30.Видимость = ?(Редакция = Перечисления.РедакцииВебКабинетаСУ.Редакция30, Истина, Ложь);
	Элементы.ГруппаРедакция20.Видимость = ?(Редакция = Перечисления.РедакцииВебКабинетаСУ.Редакция20, Истина, Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВерсияВебКабинетаНаКлиенте = Неопределено;
	ПутьКДистрибутивуНаКлиенте = Неопределено;	
	
	#Если НЕ ВебКлиент Тогда
		
	СистемнаяИнформация = Новый СистемнаяИнформация();
	
	Если (СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86) 
		ИЛИ (СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64) Тогда
		
		КаталогиШаблоновКонфигураций = ОбщегоНазначенияСУКлиент.КаталогиШаблоновКонфигураций();
		
		Для каждого ПутьККаталогуШаблонов Из КаталогиШаблоновКонфигураций Цикл
			
			ПутьККаталогуДистрибутивовВебКабинета = ПутьККаталогуШаблонов + "1c\SDO\WebCabinet\";
			НомерРедакцииМаска = СтрЗаменить(РедакцияСтрока, ".", "_");
			
			МассивСборокВКаталоге = НайтиФайлы(ПутьККаталогуДистрибутивовВебКабинета, НомерРедакцииМаска + "_*", Ложь);
			
			Для каждого ТекущийКаталог Из МассивСборокВКаталоге Цикл			
				
				Если ТекущийКаталог.ЭтоКаталог() Тогда
					
					ИмяКаталогаСтрока = ТекущийКаталог.Имя;
					НомерВерсииСтрока = СтрЗаменить(ИмяКаталогаСтрока, "_", ".");
					
					Если НЕ ЗначениеЗаполнено(ВерсияВебКабинетаНаКлиенте)
						ИЛИ ОбщегоНазначенияКлиентСервер.СравнитьВерсии(НомерВерсииСтрока, ВерсияВебКабинетаНаКлиенте) > 0 Тогда
						
						ВерсияВебКабинетаНаКлиенте = НомерВерсииСтрока;
						ПутьКДистрибутивуНаКлиенте = ТекущийКаталог.ПолноеИмя + "\" + ИмяФайлаДистрибутива;
						
					КонецЕсли;
										
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;		
			
	#КонецЕсли	
	
	Элементы.ГруппаДистрибутивНаКлиенте.Видимость = ЗначениеЗаполнено(ПутьКДистрибутивуНаКлиенте);
	Элементы.ДекорацияДистрибутивНеНайден.Видимость = НЕ ЗначениеЗаполнено(ПутьКДистрибутивуНаКлиенте);
	Элементы.ДекорацияДистрибутивНеНайден30.Видимость = НЕ ЗначениеЗаполнено(ПутьКДистрибутивуНаКлиенте);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ТемаПриИзменении(Элемент)
	УстановитьКартинкуТемы();
КонецПроцедуры

&НаКлиенте
Процедура РегистрационныйНомерПриИзменении(Элемент)
	РегистрационныйНомерПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Установить(Команда)
	
	Если АвтоматическаяНастройка
		И НЕ ЗначениеЗаполнено(РегистрационныйНомер) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Укажите регистрационный номер'"),,"РегистрационныйНомер");
		Возврат;
		
	КонецЕсли;
	
	Если АвтоматическаяНастройка
		И НЕ РегистрационныйНомерКорректный Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Укажите корректный регистрационный номер'"),,"РегистрационныйНомер");
		Возврат;
		
	КонецЕсли;
	
	// Определяем переменные
	
	АдресХраненияДистрибутиваНаСервере = "";
	ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжениеУстановки", ЭтотОбъект);
	
	Если ЗначениеЗаполнено(ПутьКДистрибутивуНаКлиенте) Тогда
		НачатьПомещениеФайла(ОписаниеОповещения,, ПутьКДистрибутивуНаКлиенте, Ложь, УникальныйИдентификатор);
	Иначе
		НачатьПомещениеФайла(ОписаниеОповещения,,, Истина, УникальныйИдентификатор);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПродолжениеУстановки(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат ИЛИ НЕ ЗначениеЗаполнено(ВыбранноеИмяФайла) Тогда
		Возврат;
	КонецЕсли;
	
	АдресХраненияДистрибутиваНаСервере = Адрес; // Сохраняем в реквизите
	Статус = НСтр("ru = 'Дистрибутив помещен во временное хранилище'", "ru");	
	
	Если ОпубликоватьВебКабинет() = ИСТИНА Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Установка успешно завершена'"));
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Функция ОпубликоватьВебКабинет() Экспорт
	
	Если НЕ МонопольныйРежим() Тогда
				
		Попытка
			МассивПараметровФЗ = Новый Массив;
			МассивПараметровФЗ.Добавить("УстановкаВебКабинета");
			ФоновыеЗадания.Выполнить("ОбновлениеИнформационнойБазыСУО.ОтправитьСтатистикуИспользования", МассивПараметровФЗ); //--# Заменить на ОбновлениеИнформационнойБазыКК
		Исключение
			// Не требуется
		КонецПопытки;				
		
	КонецЕсли;	
	
	// Копируем файлы веб-кабинета
	
	РезультатИнициализации = ВебКабинетСУ.ИнициализироватьКаталогВебКабинета(ДляТестирования, ОчищатьПередВыгрузкой, Тема, АдресХраненияДистрибутиваНаСервере);
	
	Если НЕ РезультатИнициализации.КаталогИнициализирован Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Каталог не инициализирован. Причина ошибки: '") + РезультатИнициализации.ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;	
	
	// Определяем будут ли формироваться задания
			
	Если ОчищатьПередВыгрузкой Тогда
		СформироватьЗаданияНаОбновление = Истина;
	ИначеЕсли Справочники.ПубликацииВебКабинетаСУ.ЕстьПубликации() Тогда
		СформироватьЗаданияНаОбновление = ОбновитьДанныеБазы;
	Иначе		
		СформироватьЗаданияНаОбновление = Истина;
	КонецЕсли;
	
	// Формируем публикацию для автоматической настройки
	
	Если АвтоматическаяНастройка Тогда
		
		Если НЕ ЗначениеЗаполнено(РегистрационныйНомер) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Укажите регистрационный номер'"),,"РегистрационныйНомер");
			Возврат Ложь;
		КонецЕсли;
		
		НачатьТранзакцию();
		
		Попытка
			
			ПубликацияСсылка = Справочники.ПубликацииВебКабинетаСУ.ЕдинственнаяПубликацияВОбщемКаталоге();
			
			Если ЗначениеЗаполнено(ПубликацияСсылка) Тогда
				ПубликацияОбъект = ПубликацияСсылка.ПолучитьОбъект();
			Иначе
				ПубликацияОбъект = Справочники.ПубликацииВебКабинетаСУ.СоздатьЭлемент();
				ПубликацияОбъект.ДополнительныеСвойства.Вставить("ИспользоватьПоУмолчанию", Истина);
				ПубликацияОбъект.Редакция = ВебКабинетСУ.Редакция();
			КонецЕсли;		
			
			ПубликацияОбъект.РегистрационныйНомер = РегистрационныйНомер;
			ПубликацияОбъект.ЗаполнитьАвтоматическуюПубликацию();
			
			ПубликацияОбъект.Записать();
			
			ПубликацияОбъект.ЗаписатьФайлНастроек();
			
			ЗафиксироватьТранзакцию();
		
		Исключение
		
		 	ОтменитьТранзакцию();
			ВызватьИсключение;
			
		КонецПопытки;
				
	КонецЕсли;
	
	// Формируем данные веб-кабинета

	Если СформироватьЗаданияНаОбновление Тогда
		Возврат ВебКабинетСУ.ЗаполнитьДанныеВебКабинета(ОчищатьПередВыгрузкой, ФоновымЗаданием);
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура УстановитьКартинкуТемы()
	
	Элементы.ДекорацияВидТемы.Картинка = Новый Картинка();
	
	Если Тема = Перечисления.ТемыВебКабинетаСУ.Облако Тогда
		Элементы.ДекорацияВидТемы.Картинка = БиблиотекаКартинок.ТемаВебКабинетаОблако;
	КонецЕсли;
	
	Если Тема = Перечисления.ТемыВебКабинетаСУ.Аквамарин Тогда
		Элементы.ДекорацияВидТемы.Картинка = БиблиотекаКартинок.ТемаВебКабинетаАквамарин;
	КонецЕсли;	
	
	Если Тема = Перечисления.ТемыВебКабинетаСУ.Лето Тогда
		Элементы.ДекорацияВидТемы.Картинка = БиблиотекаКартинок.ТемаВебКабинетаЛето;
	КонецЕсли;
	
	Если Тема = Перечисления.ТемыВебКабинетаСУ.Пляж Тогда
		Элементы.ДекорацияВидТемы.Картинка = БиблиотекаКартинок.ТемаВебКабинетаПляж;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура РегистрационныйНомерПриИзмененииНаСервере()
	
	РегистрационныйНомерКорректный = Ложь;
	
	Если НЕ ЗначениеЗаполнено(РегистрационныйНомер) Тогда
		ОписаниеРегистрационногоНомера = НСтр("ru = 'Укажите регистрационный номер.'");
		Возврат;
	КонецЕсли;		
	
	ОписаниеНомера = ЛицензированиеВебКабинетаСУ.НайтиРегистрационныйНомер(РегистрационныйНомер);
	РезультатПроверки = ЛицензированиеВебКабинетаСУ.РезультатПроверкиРегистрационногоНомера(ОписаниеНомера);
	
	Если ЗначениеЗаполнено(РезультатПроверки) Тогда
		ОписаниеРегистрационногоНомера = РезультатПроверки;
	Иначе
		РегистрационныйНомерКорректный = Истина;
		ОписаниеРегистрационногоНомера = ОписаниеНомера.ЛицензионныеОграничения;
	КонецЕсли;
		
КонецПроцедуры


#КонецОбласти
